tap "homebrew/cask"

# CLI: https://formulae.brew.sh/formula/
brew "pstree"
brew "tree"
brew "htop"
brew "nmap"
brew "jq"
brew "ghq"
brew "peco"
brew "tmux"
brew "watch"
brew "ctags"
brew "vim"
brew "neovim"
brew "shfmt"
brew "awscli"
brew "gcutil"
brew "fabianishere/personal/pam_reattach"

# Programming Languages
brew "go@1.17"
brew "gopls"
brew "golangci-lint"
brew "efm-langserver" # required from vim-lsp
brew "node@14"
brew "yarn"
brew "deno"

# Apps: https://formulae.brew.sh/cask/
cask "google-cloud-sdk"
#cask "google-japanese-ime"
#cask "google-chrome"
#cask "macvim"
#cask "iterm2"
#cask "docker"
#cask "vimr"
#cask "visual-studio-code"
#cask "notion"
#cask "kindle"
## paid
#cask "lastpass"
#cask "loopback"
#cask "audio-hijack"
#cask "grammarly"
#
## if needed
#cask "figma"
#cask "gimp"
#cask "inkscape"
#cask "java"

